# players = [
#     {"Спортсмен": "Иванов", "Количество побед": 10, "Доп. показатель": 256},
#     {"Спортсмен": "Петров", "Количество побед": 30, "Доп. показатель": 1000},
#     {"Спортсмен": "Медведев", "Количество побед": 30, "Доп. показатель": 1100},
#     {"Спортсмен": "Сидоров", "Количество побед": 20, "Доп. показатель": 300},
#     {"Спортсмен": "Уткин", "Количество побед": 10, "Доп. показатель": 256},
#     {"Спортсмен": "Васин", "Количество побед": 5, "Доп. показатель": 100}
# ]
#
# players.sort(key=lambda player: (player["Количество побед"], player["Доп. показатель"]), reverse=True)
#
# place = 1
# i, cnt = 0, 1
# result = [{"Спортсмен": players[0]["Спортсмен"], "Место": place}]
# while i < len(players) - 1:
#     while i < len(players) - 1 and (players[i]["Количество побед"], players[i]["Доп. показатель"]) == (players[i+1]["Количество побед"], players[i+1]["Доп. показатель"]):
#         result.append({"Спортсмен": players[i+1]["Спортсмен"], "Место": place})
#         i += 1
#         cnt += 1
#     place += max(cnt, 1)
#     cnt = 1
#     result.append({"Спортсмен": players[i+1]["Спортсмен"], "Место": place})
#     i += 1
# print(*result, sep='\n')
from random import shuffle
s = list('sdfgjmk;tb')
shuffle(s)
print(s)